%  该m文件会自行要求你输入相关参数（使用此m文件前请熟悉层次分析法的几个矩阵）
% 程序加入了对每个系数的检验，该成目前适用于 一层准则层+一层决策层

%测试数据
%[1 1/7 1/5 2 4 1/3;7 1 3 5 5 3;5 1/3 1 5 5 3;1/2 1/3 1/5 1 2 1/3;1/4 1/5 1/5 1/2 1 1/5;3 1/3 1/3 3 5 1]

%[1 1/4 1/2;4 1 3;2 1/3 1]

%[1 1/4 1/5;4 1 1/2;5 2 1]

%[1 1/2 2; 2 1 3;1/2 1/3 1]

%[1 1/3 5;3 1 7;1/5 1/7 1]

%[1 1 7;1 1 7;1/7 1/7 1]

%[1 7 9;1/7 1 1;1/9 1 1]


clc,clear;
disp('请输入准则层判断矩阵A(n阶)');
A=input('A=');
[n,n]=size(A);

%下一步求判断矩阵，各个目标的权向量，对于不一致的比较矩阵，
 %用最大特征根，做为权向量
[V,D]=eig(A);%求得特征向量和 特征值
            %求出最大特征值和它所对应的特征向量
 eigenvalue=diag(D);
 pos=find(max(eigenvalue)); %x为特征向量，y为特征值，lamda为最大特征值，
 lamda=eigenvalue(pos);
 w1=abs(V(:,pos));
 w1=w1/sum(w1);
t=D(pos,pos);
disp('准则层特征向量w=');disp(w1);disp('准则层最大特征根t=');disp(t);

%以下是一致性检验
RI=[0 0 0.52 0.89 1.12 1.26 1.36 1.41 1.46 1.49 1.52 1.54 1.56 1.58 1.59 1.60 1.61 1.615 1.62 1.63];
CI=(t-n)/(n-1);
CR=CI/RI(n);
if CR<0.10
    disp('此矩阵的一致性可以接受!');
    disp('CI=');disp(CI);
    disp('CR=');disp(CR);
else disp('此矩阵的一致性验证失败，请重新进行评分!');
end

%以下为方案层各因素对准则层因素权重的影响
disp('请输入方案层各因素对准则层各因素权重的成对比较阵');
for i=1:n
    disp(['请输入第',num2str(i),'个准则层因素的判断矩阵B']);%disp(i);disp('个准则层因素的判断矩阵B');
    G=input('=');    
    [m,m]=size(G);
    [V,D]=eig(G);%求得特征向量和特征值
            %求出最大特征值和它所对应的特征向量
    eigenvalue=diag(D);
 pos=find(max(eigenvalue)); %x为特征向量，y为特征值，lamda为最大特征值，
 lamda=eigenvalue(pos);
 w2(:,i)=abs(V(:,pos));
 w2(:,i)=w2(:,i)/sum(w2(:,i));
 t=D(pos,pos);
 disp('方案层各因素对准则层特征向量w=');disp(w2(:,i));disp('方案层各因素对准则层最大特征根t=');disp(t);
 
 %以下是一致性检验
 CI=(t-m)/(m-1);
 CR=CI/RI(m);
    if CR<0.10
        disp('此矩阵的一致性可以接受!');
         disp('CI=');disp(CI);
         disp('CR=');disp(CR);
    else disp('此矩阵的一致性验证失败，请重新进行评分并在clear后重新运行程序!');
    end
end

%以下是将准则层各个因素的权重向量和 方案层对准则层权重的综合
sumW=w2*w1;
sumW=sumW/sum(sumW);
disp('各个目标的权重比例为：');disp(sumW);




